Opentrons/opentrons-modules/stm32-modules/thermocycler-refresh/firmware/system/system_hardware.c
#include "firmware/system_hardware.h"
#include "stm32g4xx_hal.h"
#include "stm32g4xx_hal_rcc.h"
#include "stm32g4xx_hal_cortex.h"
#include "stm32g4xx_hal_tim.h"

/** Private definitions.*/
#define DBG_LED_PIN GPIO_PIN_6
#define DBG_LED_PORT GPIOE

#define BUTTON_LED_PIN (GPIO_PIN_10)
#define BUTTON_LED_PORT (GPIOD)

#define FRONT_BUTTON_IN_PIN (GPIO_PIN_13)
#define FRONT_BUTTON_IN_PORT (GPIOC)
#define FRONT_BUTTON_IRQ (EXTI15_10_IRQn)

// Front button can only be pressed at 200ms increments
#define FRONT_BUTTON_DEBOUNCE_MS (200)

/** Global variable instantiation */

typedef struct SystemHardware_struct {
    uint32_t button_last_tick;
    front_button_callback_t button_callback;
} SystemHardware_t;

static SystemHardware_t _system = {
    .button_callback = 0,
    .button_callback = NULL
};

/** PUBLIC FUNCTION IMPLEMENTATION */

/**
 * Initialize hardware specific to the system process:
 * - PE6 = Heartbeat LED
 * - PD10 = Front switch LED
 * - PC13 = Front switch input
 */
void system_hardware_setup(front_button_callback_t button_cb) {
    GPIO_InitTypeDef gpio_init = {
      .Pin = DBG_LED_PIN,
      .Mode = GPIO_MODE_OUTPUT_PP,
      .Pull = GPIO_NOPULL,
      .Speed = GPIO_SPEED_FREQ_LOW
    };
    __HAL_RCC_GPIOE_CLK_ENABLE();
    HAL_GPIO_Init(DBG_LED_PORT, &gpio_init);

    gpio_init.Pin = BUTTON_LED_PIN;
    __HAL_RCC_GPIOD_CLK_ENABLE();
    HAL_GPIO_Init(BUTTON_LED_PORT, &gpio_init);
    // Initialize the LED pin on to turn it on
    HAL_GPIO_WritePin(BUTTON_LED_PORT, BUTTON_LED_PIN, GPIO_PIN_SET);

    gpio_init.Pin = FRONT_BUTTON_IN_PIN;
    gpio_init.Mode = GPIO_MODE_IT_FALLING;
    __HAL_RCC_GPIOC_CLK_ENABLE();
    HAL_GPIO_Init(FRONT_BUTTON_IN_PORT, &gpio_init);

    HAL_NVIC_SetPriority(FRONT_BUTTON_IRQ, 5, 0);
    HAL_NVIC_EnableIRQ(FRONT_BUTTON_IRQ);

    _system.button_last_tick = HAL_GetTick();
    _system.button_callback = button_cb;
}

// This is the start of the sys memory region for the STM32G491 
// from the reference manual and STM application note AN2606
#define SYSMEM_START 0x1fff0000
#define SYSMEM_BOOT (SYSMEM_START + 4)

// address 4 in the bootable region is the address of the first instruction that
// should run, aka the data that should be loaded into $pc.
const uint32_t *const sysmem_boot_loc = (uint32_t*)SYSMEM_BOOT;

void system_debug_led(int set)
{
    GPIO_PinState state = (set > 0) ? GPIO_PIN_SET : GPIO_PIN_RESET;
    HAL_GPIO_WritePin(GPIOE, GPIO_PIN_6, state);
}

void system_hardware_enter_bootloader(void) {

    // We have to uninitialize as many of the peripherals as possible, because the bootloader
    // expects to start as the system comes up

    // The HAL has ways to turn off all the core clocking and the clock security system
    HAL_RCC_DisableLSECSS();
    HAL_RCC_DeInit();

    // systick should be off at boot
    SysTick->CTRL = 0;
    SysTick->LOAD = 0;
    SysTick->VAL = 0;


    /* Clear Interrupt Enable Register & Interrupt Pending Register */
    for (int i=0;i<8;i++)
    {
        NVIC->ICER[i]=0xFFFFFFFF;
        NVIC->ICPR[i]=0xFFFFFFFF;
    }

    // We have to make sure that the processor is mapping the system memory region to address 0,
    // which the bootloader expects
    __HAL_SYSCFG_REMAPMEMORY_SYSTEMFLASH();
    // and now we're ready to set the system up to start executing system flash.
    // arm cortex initialization means that

    // address 0 in the bootable region is the address where the processor should start its stack
    // which we have to do as late as possible because as soon as we do this the c and c++ runtime
    // environment is no longer valid
    __set_MSP(*((uint32_t*)SYSMEM_START));

    // finally, jump to the bootloader. we do this in inline asm because we need
    // this to be a naked call (no caller-side prep like stacking return addresses)
    // and to have a naked function you need to define it as a function, not a
    // function pointer, and we don't statically know the address here since it is
    // whatever's contained in that second word of the bsystem memory region.
    asm volatile (
        "bx %0"
        : // no outputs
        : "r" (*sysmem_boot_loc)
        : "memory"  );
}

bool system_front_button_pressed(void) {
    // Active low button, passively pulled high
    return HAL_GPIO_ReadPin(FRONT_BUTTON_IN_PORT, FRONT_BUTTON_IN_PIN) 
                == GPIO_PIN_RESET;
}

void system_front_button_callback(void) {
    if(__HAL_GPIO_EXTI_GET_IT(FRONT_BUTTON_IN_PIN) != 0x00u) {
        __HAL_GPIO_EXTI_CLEAR_IT(FRONT_BUTTON_IN_PIN);
        uint32_t new_tick = HAL_GetTick();
        if(new_tick >  _system.button_last_tick + 
                        FRONT_BUTTON_DEBOUNCE_MS) {
            _system.button_last_tick = new_tick;
            if(_system.button_callback) {
                _system.button_callback();
            }
        }
    }
}
